## Pandas常规操作

In [1]:
import pandas as pd

In [2]:
data = {'name': ['zhangsan', 'lisi'],
        'year': [1997, 1998],
        'length':[1, 2]}
df = pd.DataFrame(data)

In [3]:
df # 查看数据

       name  year  length
0  zhangsan  1997       1
1      lisi  1998       2

### 查询行数据

In [4]:
print("查询行:\n", df.loc[0])

查询行:
 name      zhangsan
year          1997
length           1
Name: 0, dtype: object

In [5]:
print("查询多行:\n", df.loc[0:1]) # 两个闭区间

查询多行:
        name  year  length
0  zhangsan  1997       1
1      lisi  1998       2

### 查询列数据

In [6]:
print("查询列：\n", df['year'])

查询列：
 0    1997
1    1998
Name: year, dtype: int64

In [7]:
print("查询多列：", df[['year', 'length']]) # 查询多列的时候，需要将多个列放入到一个list中。

查询多列：    year  length
0  1997       1
1  1998       2

## 拼接

In [8]:
df = pd.concat([df, df])

In [9]:
df

       name  year  length
0  zhangsan  1997       1
1      lisi  1998       2
0  zhangsan  1997       1
1      lisi  1998       2

In [10]:
from sklearn.utils import shuffle
df = shuffle(df)
df

       name  year  length
0  zhangsan  1997       1
1      lisi  1998       2
0  zhangsan  1997       1
1      lisi  1998       2

## 插入列

In [11]:
row, column = df.shape
df.insert(0, "label", [0]*row)
df

   label      name  year  length
0      0  zhangsan  1997       1
1      0      lisi  1998       2
0      0  zhangsan  1997       1
1      0      lisi  1998       2

In [12]:
df = df.fillna(0) #排除Nan
df

   label      name  year  length
0      0  zhangsan  1997       1
1      0      lisi  1998       2
0      0  zhangsan  1997       1
1      0      lisi  1998       2

In [13]:
column_name = df.columns
column_name

Index(['label', 'name', 'year', 'length'], dtype='object')

In [14]:
df = df[column_name[1:]]
df

       name  year  length
0  zhangsan  1997       1
1      lisi  1998       2
0  zhangsan  1997       1
1      lisi  1998       2